// ========================================
// PLAYER
// ========================================

player_x = 0;
player_y = 0;
player_z = -5;


// ========================================
// ROTAÇÃO
// ========================================

yaw = 0;
pitch = 0;


// ========================================
// MOVIMENTO
// ========================================

move_speed = 0.05;


// ========================================
// PLAYER LOCAL
// ========================================

global.local_player = id;


// ========================================
// MOUSE
// ========================================

mouse_sensitivity = 0.15;

mouse_center_x = window_get_width() * 0.5;
mouse_center_y = window_get_height() * 0.5;

window_mouse_set(
    mouse_center_x,
    mouse_center_y
);

// ========================================
// FÍSICA VERTICAL
// ========================================

vertical_velocity = 0;

gravity = 0.01;

jump_force = 0.18;

grounded = false;